In [1]:
people={
    "first": ["Nishant", "Ram", "Shyam"],
    "last" : ["Neupane", "Sitaula", "Dahal"],
    "email" : ["nishant.neupane@gmail.com","ram.sitaula@gmail.com", "shyam.dahal@gmail.com"]
}
import pandas as pd
df = pd.DataFrame(people)

### Adding new column to existing dataframe (by manipulating existing columns)

In [2]:
df['full_name'] = df['first'] + ' ' + df['last']

In [3]:
df

     first     last                      email        full_name
0  Nishant  Neupane  nishant.neupane@gmail.com  Nishant Neupane
1      Ram  Sitaula      ram.sitaula@gmail.com      Ram Sitaula
2    Shyam    Dahal      shyam.dahal@gmail.com      Shyam Dahal

### Dropping columns

In [4]:
df.drop(columns=['first', 'last'])

                       email        full_name
0  nishant.neupane@gmail.com  Nishant Neupane
1      ram.sitaula@gmail.com      Ram Sitaula
2      shyam.dahal@gmail.com      Shyam Dahal

In [5]:
df.drop(columns='first')

      last                      email        full_name
0  Neupane  nishant.neupane@gmail.com  Nishant Neupane
1  Sitaula      ram.sitaula@gmail.com      Ram Sitaula
2    Dahal      shyam.dahal@gmail.com      Shyam Dahal

In [6]:
df.drop(columns=['first', 'last'], inplace=True)

## Splitting a column value into two columns (delimited by space)

In [7]:
df

                       email        full_name
0  nishant.neupane@gmail.com  Nishant Neupane
1      ram.sitaula@gmail.com      Ram Sitaula
2      shyam.dahal@gmail.com      Shyam Dahal

In [8]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)

In [9]:
df

                       email        full_name    first     last
0  nishant.neupane@gmail.com  Nishant Neupane  Nishant  Neupane
1      ram.sitaula@gmail.com      Ram Sitaula      Ram  Sitaula
2      shyam.dahal@gmail.com      Shyam Dahal    Shyam    Dahal

### Appending a new row and appending new dataframe to existing df

In [10]:
pd.concat([df, pd.DataFrame({"first" : ["Hari"]})], ignore_index=True)
# ignore index ignores the index of new dataframe

                       email        full_name    first     last
0  nishant.neupane@gmail.com  Nishant Neupane  Nishant  Neupane
1      ram.sitaula@gmail.com      Ram Sitaula      Ram  Sitaula
2      shyam.dahal@gmail.com      Shyam Dahal    Shyam    Dahal
3                        NaN              NaN     Hari      NaN

## Appending a new dataframe onto another dataframe

In [11]:
# lets create a new dataframe
people={
    "first": ["Test1", "Test2"],
    "last" : ["Test3", "Test4"],
    "email" : ["test1@email.com","test2@email.com"]
}
df2 = pd.DataFrame(people)

In [12]:
pd.concat([df, df2])

                       email        full_name    first     last
0  nishant.neupane@gmail.com  Nishant Neupane  Nishant  Neupane
1      ram.sitaula@gmail.com      Ram Sitaula      Ram  Sitaula
2      shyam.dahal@gmail.com      Shyam Dahal    Shyam    Dahal
0            test1@email.com              NaN    Test1    Test3
1            test2@email.com              NaN    Test2    Test4

In [13]:
# to continue the index,
df = pd.concat([df, df2], ignore_index=True)
df

                       email        full_name    first     last
0  nishant.neupane@gmail.com  Nishant Neupane  Nishant  Neupane
1      ram.sitaula@gmail.com      Ram Sitaula      Ram  Sitaula
2      shyam.dahal@gmail.com      Shyam Dahal    Shyam    Dahal
3            test1@email.com              NaN    Test1    Test3
4            test2@email.com              NaN    Test2    Test4

## Dropping rows

In [15]:
# dropping row of index 4
df.drop(index=4)

                       email        full_name    first     last
0  nishant.neupane@gmail.com  Nishant Neupane  Nishant  Neupane
1      ram.sitaula@gmail.com      Ram Sitaula      Ram  Sitaula
2      shyam.dahal@gmail.com      Shyam Dahal    Shyam    Dahal
3            test1@email.com              NaN    Test1    Test3

In [21]:
# dropping all rows that contains last name as Dahal

filt = df[df['last'] == 'Dahal'].index # gives a list of indexes
df.drop(index=filt, inplace=True)

In [22]:
df

                       email        full_name    first     last
0  nishant.neupane@gmail.com  Nishant Neupane  Nishant  Neupane
1      ram.sitaula@gmail.com      Ram Sitaula      Ram  Sitaula
3            test1@email.com              NaN    Test1    Test3
4            test2@email.com              NaN    Test2    Test4